---
kind: other
id: Properties.T:Autodesk.Revit.DB.Electrical.LightingFixture
source: html/de5dad1e-46a3-da6e-c0ad-c3306ec13f5a.htm
---
# LightingFixture Properties

Retrieves the Connector Manager from this MEPModel.